app/views/orders/index.html.erb

  <tbody>
    <% order.get_item_orders.each do |item_order| %>
---
SELECT "item_orders".* FROM "item_orders" WHERE "item_orders"."order_id" = $1  [["order_id", 5]]