app/helpers/application_helper.rb

SELECT COUNT(*) FROM "item_carts" WHERE "item_carts"."cart_id" = $1  [["cart_id", 72]]
---
  def amount_item_cart
    return ItemCart.where(cart: current_user.cart).count