app/controllers/carts_controller.rb

  def create
    @cart = Cart.find(params[:id])
    @item = Item.find(params[:item_id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]