app/controllers/carts_controller.rb

  def index
    @cart = current_user.cart
    @item_carts = ItemCart.where(cart: @cart)
---
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 7], ["LIMIT", 1]]

  def create
    @cart = Cart.find(current_user.cart.id)
    @item = Item.find(params[:item_id])

    # Check item is already in card
    check_item = ItemCart.find_by(item: @item, cart: @cart);
    if !check_item.nil?
      flash[:error] = "This item is already added in cart."
      return redirect_to items_path
    end
    item_cart = ItemCart.new(cart: @cart, item: @item)
    if item_cart.save
---
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 7], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
INSERT INTO "item_carts" ("cart_id", "item_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["cart_id", 16], ["item_id", 12], ["created_at", "2020-09-02 18:41:27.395967"], ["updated_at", "2020-09-02 18:41:27.395967"]]

  def destroy
    @item_cart = ItemCart.find(params[:item_cart_id])
    if @item_cart.destroy
---
SELECT  "item_carts".* FROM "item_carts" WHERE "item_carts"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "item_carts" WHERE "item_carts"."id" = $1  [["id", 9]]