app/controllers/charges_controller.rb

  def new
    @cart = current_user.cart
    @item_carts = ItemCart.where(cart: @cart)
---
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 7], ["LIMIT", 1]]

  def create
    @cart = current_user.cart
    @item_carts = ItemCart.where(cart: @cart)
---
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 7], ["LIMIT", 1]]

  def cart_empty
    @order = Order.create(user: current_user)
    @cart = current_user.cart
    item_carts = ItemCart.where(cart: @cart)
    item_carts.each do |item_cart|
      ItemOrder.create(item: item_cart.item, order: @order)
      item_cart.destroy
---
INSERT INTO "orders" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 7], ["created_at", "2020-09-02 19:03:41.175758"], ["updated_at", "2020-09-02 19:03:41.175758"]]
SELECT "item_carts".* FROM "item_carts" WHERE "item_carts"."cart_id" = $1  [["cart_id", 16]]
INSERT INTO "item_orders" ("item_id", "order_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["item_id", 12], ["order_id", 13], ["created_at", "2020-09-02 19:03:46.776314"], ["updated_at", "2020-09-02 19:03:46.776314"]]
DELETE FROM "item_carts" WHERE "item_carts"."id" = $1  [["id", 10]]