app/controllers/items_controller.rb

SELECT "items".* FROM "items" ORDER BY "items"."updated_at" DESC
---
  def index
    @items = Item.all.order(updated_at: :desc)

INSERT INTO "items" ("title", "description", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Lovely Hana"], ["description", "This is very cute cate"], ["price", 5.0], ["created_at", "2020-09-03 06:45:33.178727"], ["updated_at", "2020-09-03 06:45:33.178727"]]
---
  def create
    @item = Item.new(item_params)

    if @item.save

UPDATE "items" SET "updated_at" = $1 WHERE "items"."id" = $2  [["updated_at", "2020-09-03 06:46:16.486683"], ["id", 104]]
---
  def update
    if current_user.is_admin

      puts "----------------------------------"
      puts item_params

      if @item.update(item_params)

DELETE FROM "items" WHERE "items"."id" = $1  [["id", 102]]
---
  def destroy
    if !current_user.is_admin
      flash[:error] = "Permission denied!"
      return redirect_back(fallback_location: root_path)
    end
    @item.destroy