app/controllers/items_controller.rb

UPDATE "items" SET "updated_at" = $1 WHERE "items"."id" = $2  [["updated_at", "2020-09-03 06:45:33.184203"], ["id", 105]]
---
  def update
    if current_user.is_admin
      if @item.update(item_params)