app/controllers/orders_controller.rb

  def index
    @orders = current_user.orders
---
SELECT "item_orders".* FROM "item_orders" WHERE "item_orders"."order_id" = $1  [["order_id", 5]]
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 2]]

  def show
    @order = Order.find(params[:id])
---
SELECT "item_orders".* FROM "item_orders" WHERE "item_orders"."order_id" = $1  [["order_id", 5]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]