app/models/cart.rb

SELECT COUNT(*) FROM "item_carts" WHERE "item_carts"."cart_id" = $1  [["cart_id", 16]]
---
  def is_empty?
    return self.get_item_carts.count <1