app/models/user.rb

  def must_create_cart
    cart = Cart.new(user: self)
    cart.save ? true : cart.errors
---
INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 8], ["created_at", "2020-09-02 19:12:28.243944"], ["updated_at", "2020-09-02 19:12:28.243944"]]